In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8,"a"])
s
#Series는 python의 기초 데이터 유형임.내부 타입은 가변적, 복합적으로 넣었을 경우 object 타입 리턴

0      1
1      3
2      5
3    NaN
4      6
5      8
6      a
dtype: object

In [3]:
dates = pd.date_range('20130101', periods=6)
dates
#기본형 date 타입

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df
#6행 4열의 랜덤 변수를 프레임에 넣는데 인덱스는 dates고 컬럼은 abcd로..
#선언한 데이터프레임과 다를 경우 Shape of passed values is (5, 6), indices imply (4, 6) 에러가 발생

                   A         B         C         D
2013-01-01 -0.555638  0.233530  1.411905  0.602979
2013-01-02 -0.769392  0.797672  1.415552  0.465755
2013-01-03 -0.800816 -2.091437 -0.409948  0.795499
2013-01-04 -0.375238  0.796997 -0.851041 -0.643831
2013-01-05  1.056293 -0.380546  1.232017  0.648351
2013-01-06 -0.284452 -0.047027 -1.027596 -0.620365

In [5]:
#df.index
new_dates = df.index
new_dates
#dates 타입으로 리턴이 됨

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df.columns
#columns는 index가 리턴됨
a = df.columns
print(a[0])
print(type(a))

A
<class 'pandas.core.indexes.base.Index'>

In [7]:
df.info() #정보를 출력함

df['20130102':'20130104']
df[dates[0]:dates[1]]
#오로지 date 타입만 가능함

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

                   A         B         C         D
2013-01-01 -0.555638  0.233530  1.411905  0.602979
2013-01-02 -0.769392  0.797672  1.415552  0.465755

In [8]:
print(df.loc[dates[0]])
#인덱스인 날짜를 기준으로 슬라이싱

print(df.loc[:,['A','B']])
#모든날짜의 특정 칼럼만 슬라이싱

print(df.loc[dates[0]:dates[1],["A","B"]])
#특정 날짜의 특정 칼럼만 슬라이싱

A   -0.555638
B    0.233530
C    1.411905
D    0.602979
Name: 2013-01-01 00:00:00, dtype: float64
                   A         B
2013-01-01 -0.555638  0.233530
2013-01-02 -0.769392  0.797672
2013-01-03 -0.800816 -2.091437
2013-01-04 -0.375238  0.796997
2013-01-05  1.056293 -0.380546
2013-01-06 -0.284452 -0.047027
                   A         B
2013-01-01 -0.555638  0.233530
2013-01-02 -0.769392  0.797672

In [9]:
df.iloc[3]
#loc에서 특정 날짜를 직접 입력하지 않고 index로 슬라이싱

A   -0.375238
B    0.796997
C   -0.851041
D   -0.643831
Name: 2013-01-04 00:00:00, dtype: float64

In [10]:
print(df.iloc[3:5,0:2]) # 범위로 슬라이싱
print(df.iloc[[1,2,4],[0,2]]) # 특정 데이터만 슬라이싱(콤마)

                   A         B
2013-01-04 -0.375238  0.796997
2013-01-05  1.056293 -0.380546
                   A         C
2013-01-02 -0.769392  1.415552
2013-01-03 -0.800816 -0.409948
2013-01-05  1.056293  1.232017

In [11]:
df[df.A > 0]
df[df>0] #만족하지 않는 컬럼은 NaN

                   A         B         C         D
2013-01-01       NaN  0.233530  1.411905  0.602979
2013-01-02       NaN  0.797672  1.415552  0.465755
2013-01-03       NaN       NaN       NaN  0.795499
2013-01-04       NaN  0.796997       NaN       NaN
2013-01-05  1.056293       NaN  1.232017  0.648351
2013-01-06       NaN       NaN       NaN       NaN

In [12]:
#그냥 =  를 활용해서 복사하면 데이터 위치만 (주소만 참조) 복사가 되므로 실제 데이터를 변경하려면 copy를 사용하면 된다.
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three'] #행 추가
df2

                   A         B         C         D      E
2013-01-01 -0.555638  0.233530  1.411905  0.602979    one
2013-01-02 -0.769392  0.797672  1.415552  0.465755    one
2013-01-03 -0.800816 -2.091437 -0.409948  0.795499    two
2013-01-04 -0.375238  0.796997 -0.851041 -0.643831  three
2013-01-05  1.056293 -0.380546  1.232017  0.648351   four
2013-01-06 -0.284452 -0.047027 -1.027596 -0.620365  three

In [13]:
df2['E'].isin(['two','four'])
#특정 데이터의 포함조건은 isin 명령 활용 yes or no 로 표시가 됨
df2[df2['E'].isin(['two','four'])]
#포함조건이 true인 데이터만 출력 하고 싶을 때
df2

                   A         B         C         D      E
2013-01-01 -0.555638  0.233530  1.411905  0.602979    one
2013-01-02 -0.769392  0.797672  1.415552  0.465755    one
2013-01-03 -0.800816 -2.091437 -0.409948  0.795499    two
2013-01-04 -0.375238  0.796997 -0.851041 -0.643831  three
2013-01-05  1.056293 -0.380546  1.232017  0.648351   four
2013-01-06 -0.284452 -0.047027 -1.027596 -0.620365  three

In [14]:
df.apply(np.cumsum)
#np.cumsum은 내려가면서 각 데이터들을 순차적으로 합산해서 표시함. 
df.apply(lambda x: x.max() - x.min()) #람다 사용 가능

A    1.857109
B    2.889109
C    2.443149
D    1.439329
dtype: float64

In [15]:
df1 = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                   'B' : ['B0', 'B1', 'B2', 'B3'],
                   'C' : ['C0', 'C1', 'C2', 'C3'],
                   'D' : ['D0', 'D1', 'D2', 'D3']},
                  index = [0,1,2,3])

df2 = pd.DataFrame({'A' : ['A4', 'A5', 'A6', 'A7'],
                   'B' : ['B4', 'B5', 'B6', 'B7'],
                   'C' : ['C4', 'C5', 'C6', 'C7'],
                   'D' : ['D4', 'D5', 'D6', 'D7']},
                  index = [4,5,6,7])

df3 = pd.DataFrame({'A' : ['A8', 'A9', 'A10', 'A11'],
                   'B' : ['B8', 'B9', 'B10', 'B11'],
                   'C' : ['C8', 'C9', 'C10', 'C11'],
                   'D' : ['D8', 'D9', 'D10', 'D11']},
                  index = [8,9,10,11])

In [16]:
print(df1)
print(df2)
print(df3)
#열방향으로 합치면
result = pd.concat([df1,df2,df3])
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [17]:
# key를 지정한 경우
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
#열 값이 index가 됨
print(result.index)
print(result.index.get_level_values(0))
print(result.index.get_level_values(1))
result

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])
Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')
Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [18]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                  index = [2,3,6,7])
result = pd.concat([df1,df4], axis=1)
print(df1)
print(df4)
print(result)
#concat을 하면 index를 기준으로 합치기 때문에 없는 데이터는 NaN으로 합쳐짐

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7
     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [19]:
#join 옵션을 inner로 주면 교집합만 표현이 됨.
result = pd.concat([df1, df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [20]:
#데이터의 index를 무시하고 새로운 index를 부여하는 방법
result = pd.concat([df1, df4], ignore_index=True, sort=False) # sort를 명시적으로 지정해줘야 함(추후버전에서)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [21]:
left = pd.DataFrame({'key': ['K0','K4','K2','K3'],
                    'A': ['A0','A4','A2','A3'],
                    'B': ['B0','B4','B2','B3']})

right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'C': ['C0','C1','C2','C3'],
                    'D': ['D0','D1','D2','D3']})
print(left)
print(right)

  key   A   B
0  K0  A0  B0
1  K4  A4  B4
2  K2  A2  B2
3  K3  A3  B3
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [22]:
#key가 맞는 데이터만 합치게 됨
pd.merge(left,right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [25]:
#데이터 병합시 조건 넣기
print(pd.merge(left,right, how='left', on='key'))  #어느 한쪽의 데이터를 기준으로 병합
print(pd.merge(left,right, how='right', on='key')) # ''
print(pd.merge(left,right, how='outer', on='key')) #merge 한 데이터 모두를 가짐(합집합)
print(pd.merge(left,right, how='inner', on='key')) #공통된 요소만 가짐 (교집합)

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A4  B4  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3
  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1
  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A4   B4  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3